# Semana 02 Datos
## Tarea 02: Carga y Preprocesamiento de Datos.
### Parte 01: Carga de datos

In [110]:
#Importamos las paqueterias necesarias para la lectura de datos.
import pandas as pd
import numpy as np

In [111]:
#Lectura de datos
application = pd.read_csv('../Datasets/application_record.csv')
credit = pd.read_csv('../Datasets/credit_record.csv')

In [112]:
#Renombramos las columnas para mejor lectura
application.columns = [
    'ID', 'Genero', 'Dueño_Carro', 'Dueño_Propiedad', 'Num_Hijos', 'Ingresos_Anuales','Tipo_de_Ingresos', 
    'Nivel_Educación', 'Estado_Civil', 'Tipo_de_Vivienda', 'Días_desde_Cumpleaños', 'Días_desde_Empleo', 
    'Celular','Telefono_Trabajo', 'Telefono', 'Correo', 'Ocupación', 'Num_Familia'
]
print(application.info())
application.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   ID                     438557 non-null  int64
 1   Genero                 438557 non-null  object
 2   Dueño_Carro            438557 non-null  object
 3   Dueño_Propiedad        438557 non-null  object
 4   Num_Hijos              438557 non-null  int64
 5   Ingresos_Anuales       438557 non-null  float64
 6   Tipo_de_Ingresos       438557 non-null  object
 7   Nivel_Educación        438557 non-null  object
 8   Estado_Civil           438557 non-null  object
 9   Tipo_de_Vivienda       438557 non-null  object
 10  Días_desde_Cumpleaños  438557 non-null  int64
 11  Días_desde_Empleo      438557 non-null  int64
 12  Celular                438557 non-null  int64
 13  Telefono_Trabajo       438557 non-null  int64
 14  Telefono               438557 non-null  int64
 15  Correo                 438557 non-null  int64
 16  Ocupación              304354 non-null  object
 17  Num_Familia            438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB
None

,ID,Genero,Dueño_Carro,Dueño_Propiedad,Num_Hijos,Ingresos_Anuales,Tipo_de_Ingresos,Nivel_Educación,Estado_Civil,Tipo_de_Vivienda,Días_desde_Cumpleaños,Días_desde_Empleo,Celular,Telefono_Trabajo,Telefono,Correo,Ocupación,Num_Familia
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [113]:
#Renombramos las columnas para mejor lectura
credit.columns = [
    'ID', 'Mes extraccion','Estado'
]
print(credit.info())
credit.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID              1048575 non-null  int64
 1   Mes extraccion  1048575 non-null  int64
 2   Estado          1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB
None

        ID  Mes extraccion Estado
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

### Parte 02: Preprocesamiento de datos

#### Valores Nulos

In [114]:
application.isna().sum()

ID                            0
Genero                        0
Dueño_Carro                   0
Dueño_Propiedad               0
Num_Hijos                     0
Ingresos_Anuales              0
Tipo_de_Ingresos              0
Nivel_Educación               0
Estado_Civil                  0
Tipo_de_Vivienda              0
Días_desde_Cumpleaños         0
Días_desde_Empleo             0
Celular                       0
Telefono_Trabajo              0
Telefono                      0
Correo                        0
Ocupación                134203
Num_Familia                   0
dtype: int64

In [115]:
credit.isna().sum()

ID                0
Mes extraccion    0
Estado            0
dtype: int64

#### Valores Duplicados

In [116]:
print(f'Duplicates in applications df: {application.duplicated().sum()}, ({np.round(100*application.duplicated().sum()/len(application),1)}%)')
print('')
print(f'Duplicates in record df: {credit.duplicated().sum()}, ({np.round(100*credit.duplicated().sum()/len(credit),1)}%)')

Duplicates in applications df: 0, (0.0%)

Duplicates in record df: 0, (0.0%)

#### Cardinalidad de las Columnas

In [117]:
application.nunique()

ID                       438510
Genero                        2
Dueño_Carro                   2
Dueño_Propiedad               2
Num_Hijos                    12
Ingresos_Anuales            866
Tipo_de_Ingresos              5
Nivel_Educación               5
Estado_Civil                  5
Tipo_de_Vivienda              6
Días_desde_Cumpleaños     16379
Días_desde_Empleo          9406
Celular                       1
Telefono_Trabajo              2
Telefono                      2
Correo                        2
Ocupación                    18
Num_Familia                  13
dtype: int64

### Limpieza de los datos

#### Rellenar valores faltantes

In [118]:
#Rellenar los valores faltantes
application['Ocupación'].fillna(value='Other', inplace=True)

#### Eliminar columnas constantes
Eliminare la columna de Celular ya que es una columna que contiene el mismo dato para todas las filas

In [119]:
application.drop('Celular', axis=1, inplace=True)

#### Trabajamos algunas columnas

In [120]:
#Creamos la columna edad
application['Edad_Años'] = application['Días_desde_Cumpleaños']/-365.2425
application.drop('Días_desde_Cumpleaños',axis=1,inplace=True)

#Creamos la columna de Años con empleo
application['Antiguedad_Trabajo'] = application['Días_desde_Empleo']/-365.2425
application.loc[application['Días_desde_Empleo']>0,'Antiguedad_Trabajo']=0

#Creamos una columna que valide si esta desempleado
application['Desempleado']=0
application.loc[application['Días_desde_Empleo']>0,'Desempleado']=1

application.drop('Días_desde_Empleo',axis=1,inplace=True)

#### Codificación de Categorias

In [121]:
application["Genero"] =  application["Genero"].replace(['F','M'],[0,1])
application["Dueño_Carro"] = application["Dueño_Carro"].replace(["Y","N"],[1,0])
application["Dueño_Propiedad"] = application["Dueño_Propiedad"].replace(["Y","N"],[1,0])

In [122]:
application['Num_Familia']=application['Num_Familia'].astype('int64')

In [123]:
application.dtypes

ID                      int64
Genero                  int64
Dueño_Carro             int64
Dueño_Propiedad         int64
Num_Hijos               int64
Ingresos_Anuales      float64
Tipo_de_Ingresos       object
Nivel_Educación        object
Estado_Civil           object
Tipo_de_Vivienda       object
Telefono_Trabajo        int64
Telefono                int64
Correo                  int64
Ocupación              object
Num_Familia             int64
Edad_Años             float64
Antiguedad_Trabajo    float64
Desempleado             int64
dtype: object

#### Reordenamos las Columnas

In [124]:
application_clean =application[['ID', 'Genero', 'Dueño_Carro', 'Dueño_Propiedad', 'Telefono_Trabajo',
               'Telefono', 'Correo', 'Desempleado', 'Num_Hijos', 'Num_Familia', 'Ingresos_Anuales', 'Edad_Años', 'Antiguedad_Trabajo',  
               'Tipo_de_Ingresos', 'Nivel_Educación', 'Estado_Civil','Tipo_de_Vivienda', 'Ocupación']]

### Salida

In [131]:
print(application_clean.info())
application_clean.head(10)
application_clean.to_excel('../Datasets/application_clean.xlsx')
application_clean.to_csv('../Datasets/application_clean.csv', index=False, encoding='utf-8')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   ID                  438557 non-null  int64
 1   Genero              438557 non-null  int64
 2   Dueño_Carro         438557 non-null  int64
 3   Dueño_Propiedad     438557 non-null  int64
 4   Telefono_Trabajo    438557 non-null  int64
 5   Telefono            438557 non-null  int64
 6   Correo              438557 non-null  int64
 7   Desempleado         438557 non-null  int64
 8   Num_Hijos           438557 non-null  int64
 9   Num_Familia         438557 non-null  int64
 10  Ingresos_Anuales    438557 non-null  float64
 11  Edad_Años           438557 non-null  float64
 12  Antiguedad_Trabajo  438557 non-null  float64
 13  Tipo_de_Ingresos    438557 non-null  object
 14  Nivel_Educación     438557 non-null  object
 15  Estado_Civil        438557 non-null  object
 16  Tipo_de_Vivienda    438557 non-null  object
 17  Ocupación           438557 non-null  object
dtypes: float64(3), int64(10), object(5)
memory usage: 60.2+ MB
None